pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
/*
 * LoRaWAN Single Channel Gateway for ChirpStack
 * Hardware: Heltec WiFi LoRa 32 V4 (ESP32-S3 + SX1262)
 * 
 * Features:
 * - RadioLib for SX1262 support
 * - Semtech UDP protocol for ChirpStack
 * - OLED display
 * - WiFi connectivity
 * - NTP time synchronization
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <SPI.h>
#include <Wire.h>
#include <RadioLib.h>
#include <ArduinoJson.h>
#include <time.h>
#include <ArduinoOTA.h>
#include "USBCDC.h"
#include "config.h"
#include "esp32-hal.h"
#include "variant.h"
#include "common.h"
#include "TypeDef.h"
#include "power.h"

// ===========================
// OLED DISPLAY
// ===========================
#if DISPLAY_ENABLED
#include <U8g2lib.h>
// SSD1306/SSD1315 128x64 I2C display (Heltec V4 uses SSD1306)
// Hardware I2C: pins are set with Wire.begin(), only reset is needed
U8G2_SSD1306_128X64_NONAME_F_HW_I2C display(U8G2_R0, /* reset=*/ RESET_OLED);
#endif

// ===========================
// RADIO CONFIGURATION
// ===========================
SPIClass loraSPI(HSPI);
SX1262 radio = new Module(LORA_CS, LORA_DIO1, LORA_RESET, LORA_DIO2, loraSPI);

// ===========================
// NETWORK CONFIGURATION
// ===========================
WiFiUDP udpClient;
IPAddress serverIP;

const char* version = "1.0.0";

// ===========================
// GATEWAY STATE
// ===========================
uint64_t gatewayId = 0;
uint32_t packetsReceived = 0;
uint32_t packetsForwarded = 0;
unsigned long lastDisplayUpdate = 0;
unsigned long lastNtpUpdate = 0;
unsigned long lastPullData = 0;
unsigned long lastPowerCheck = 0;
unsigned long powerCheckInterval = 120000;
bool radioInitialized = false;

// Stato connessione al network server (ChirpStack), verificato tramite PULL_ACK
unsigned long lastPullAck = 0;
const unsigned long CS_LINK_TIMEOUT = 15000; // nessun ACK da 15s -> considerato offline (3x intervallo PULL_DATA)
bool isCsOnline() {
    return lastPullAck != 0 && (millis() - lastPullAck < CS_LINK_TIMEOUT);
}


// Interrupt flag for packet reception
volatile bool packetReceived = false;

// Flag per ignorare la ricezione subito dopo downlink
bool justTransmitted = false;

// Debug counters
uint32_t totalInterrupts = 0;
uint32_t crcErrors = 0;
uint32_t timeouts = 0;
uint32_t otherErrors = 0;

// ===========================
// INTERRUPT SERVICE ROUTINE
// ===========================
// Cattura il timestamp qui, non più avanti in handleLoRaPacket(): quello è il
// vero istante (a livello hardware) in cui il pacchetto è arrivato. Catturarlo
// dopo, nel loop principale, dopo Serial.print/printf e una transazione SPI
// (radio.readData()), introduce un ritardo sistematico che si somma su ogni
// pacchetto - piccolo in assoluto, ma sufficiente a far mancare consistentemente
// la finestra RX1/RX2 della Join Accept quando il margine è di poche decine di ms.
volatile unsigned long lastRxTimestamp = 0;

void IRAM_ATTR setPacketReceivedFlag() {
    lastRxTimestamp = millis();
    packetReceived = true;
}

// ===========================
// STATISTICS
// ===========================
struct Statistics {
    uint32_t rx_received;
    uint32_t rx_ok;
    uint32_t rx_fw;
    uint32_t rx_bad;
    uint32_t tx_received;
    uint32_t tx_emitted;
} stats = {0};

// ===========================
// FUNCTION DECLARATIONS
// ===========================
void initDisplay();
void updateDisplay();
void initWiFi();
void initOTA();
void initLoRa();
void initNTP();
void sendUdpPacket(const char* jsonData);
void handleLoRaPacket();
void sendStatPacket();
void sendPullData();
void handleUdpDownlink();
void sendDownlinkResponse(unsigned long rxTimestamp, PullRespPacket *pullRespPacket);
bool transmitDownlink(uint8_t* data, size_t length, unsigned long rxTimestamp);
void sendTxAck(uint16_t token);
void decodeLoRaWANPacket(uint8_t *data, size_t length);



DownlinkQueue dowQueue = DownlinkQueue();

// ===========================
// SETUP
// ===========================
void setup() {

  analogInit();
    // Initialize USB Serial
    Serial.begin(115200);
    
    // Wait for USB CDC connection (max 3 seconds)
    for(int i=0; i<30 && !Serial; i++) {
        delay(100);
    }
    
    Serial.println("\n\n===================================");
    Serial.println("LoRaWAN Gateway for ChirpStack");
    Serial.println("Hardware: Heltec WiFi LoRa 32 V4");
    Serial.println("Version: " + String(version));
    Serial.println("===================================\n");

    // Initialize LED
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);  // LED on
    
    // Initialize OLED display
    #if DISPLAY_ENABLED
    initDisplay();
    #endif
    
    // Initialize WiFi
    initWiFi();
    
    // Initialize OTA
    initOTA();
    
    // Initialize NTP
    initNTP();
    
    // Generate Gateway ID from MAC
    generateGatewayId(&gatewayId);
    
    // Initialize LoRa radio
    initLoRa();
    
    digitalWrite(LED_PIN, HIGH);  // LED off
    
    Serial.println("\n===================================");
    Serial.println("Gateway ready!");
    Serial.println("===================================\n");
}

void processDownlinkQueue() {
  PullRespPacket *pullRespPacket = dowQueue.findFirstImmediate();
  if (pullRespPacket) {
    // txpk.data is the *base64 text string* from the PULL_RESP JSON, never
    // decoded - transmitting it directly (as this did before) sends the raw
    // ASCII bytes of that string over the air instead of the actual binary
    // LoRaWAN frame. decodedPayload/decodedLength (already base64-decoded by
    // getPullResponse(), same as what the RX1/RX2 path in transmitDownlink()
    // uses) is the correct buffer.
    radio.invertIQ(true);
    int state = radio.transmit(pullRespPacket->responseData.decodedPayload, pullRespPacket->responseData.decodedLength);
    radio.invertIQ(false);
    digitalWrite(LED_PIN, HIGH);
    justTransmitted = true;

    if (state == RADIOLIB_ERR_NONE) {
      Serial.println("[PULL] ✅ Messaggio Classe C trasmesso con successo!");
      sendTxAck(pullRespPacket->token);
      dowQueue.remove(pullRespPacket);
      stats.tx_emitted++;
    } else {
      Serial.println("[PULL] ❌ Errore trasmissione messaggio Classe C");
    }
  }
}

void powerCheck() {
    uint16_t batteryVoltage = analogLevel.getBattVoltage();
    Serial.printf("[POWER] Battery voltage: %d\n", batteryVoltage);
    int batteryPercent = analogLevel.getBatteryPercent();
    Serial.printf("[POWER] Battery percent: %d\n", batteryPercent);
    bool isBatteryConnected = analogLevel.isBatteryConnect();
    Serial.printf("[POWER] Battery connected: %s\n", isBatteryConnected ? "YES" : "NO");
    bool isVbusIn = analogLevel.isVbusIn();
    Serial.printf("[POWER] Vbus in: %s\n", isVbusIn ? "YES" : "NO");
    bool isCharging = analogLevel.isCharging();
    Serial.printf("[POWER] Charging: %s\n", isCharging ? "YES" : "NO");
}
// ===========================
// MAIN LOOP
// ===========================
void loop() {
    // Handle OTA updates
    ArduinoOTA.handle();

    // Check power status periodically
    if (millis() - lastPowerCheck > powerCheckInterval) {
        powerCheck();
        lastPowerCheck = millis();
    }
    // Send PULL_DATA to ChirpStack periodically (every 5 seconds)
    if (millis() - lastPullData > 5000) {
        sendPullData();
        lastPullData = millis();
    }
    
    // Check for UDP packets from ChirpStack (downlink)
    handleUdpDownlink();
    processDownlinkQueue();
    
    // Handle incoming LoRa packets only when interrupt flag is set
    if (radioInitialized && packetReceived) {
        handleLoRaPacket();
    }
    
