pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    // Update display periodically
    #if DISPLAY_ENABLED
    if (millis() - lastDisplayUpdate > DISPLAY_UPDATE_INTERVAL) {
        updateDisplay();
        lastDisplayUpdate = millis();
    }
    #endif
    
    // Update NTP periodically
    if (millis() - lastNtpUpdate > NTP_UPDATE_INTERVAL) {
        initNTP();
        lastNtpUpdate = millis();
    }
    
    // Send statistics (vedi STAT_INTERVAL in config.h: deve combaciare con lo
    // "Stats interval" del gateway in ChirpStack, che da' per offline dopo 2x)
    static unsigned long lastStatTime = 0;
    if (lastStatTime == 0 || millis() - lastStatTime > STAT_INTERVAL) {
        sendStatPacket();
        lastStatTime = millis();
    }
    
    // Debug: stampa statistiche ogni 10 secondi
    static unsigned long lastDebugTime = 0;
    if (millis() - lastDebugTime > 120000) {
        Serial.println("\n[STATS] ===== GATEWAY STATUS =====");
        Serial.printf("[STATS] Uptime: %lu s\n", millis() / 1000);
        Serial.printf("[STATS] Interrupt totali: %lu\n", totalInterrupts);
        Serial.printf("[STATS] Pacchetti OK: %lu\n", stats.rx_ok);
        Serial.printf("[STATS] Errori CRC: %lu\n", crcErrors);
        Serial.printf("[STATS] Timeout: %lu\n", timeouts);
        Serial.printf("[STATS] Altri errori: %lu\n", otherErrors);
        Serial.printf("[STATS] Radio in ascolto: %s\n", radioInitialized ? "SI" : "NO");
        Serial.printf("[STATS] WiFi: %s\n", WiFi.isConnected() ? "OK" : "DISCONNESSO");
        Serial.println("[STATS] ===============================\n");
        lastDebugTime = millis();
    }
    
    // Small delay to prevent watchdog issues
    delay(1);
}

// ===========================
// DISPLAY FUNCTIONS
// ===========================
void initDisplay() {
    #if DISPLAY_ENABLED
    // Enable power to OLED display (active LOW)
    pinMode(VEXT_ENABLE, OUTPUT);
    digitalWrite(VEXT_ENABLE, LOW);
    delay(100); // Give the display time to power up
    
    // Initialize I2C for display
    Wire.begin(I2C_SDA, I2C_SCL);
    
    display.begin();
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);
    display.drawStr(0, 10, "LoRaWAN Gateway");
    display.drawStr(0, 25, "Initializing...");
    display.sendBuffer();
    
    Serial.println("[DISPLAY] Initialized");
    #endif
}

void updateDisplay() {
    #if DISPLAY_ENABLED
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);
    
    // Title
    display.drawStr(0, 10, "LoRaWAN Gateway");
    
    // WiFi status
    char line[32];
    snprintf(line, sizeof(line), "WiFi:%s CS:%s", WiFi.isConnected() ? "OK" : "NO", isCsOnline() ? "OK" : "NO");
    display.drawStr(0, 22, line);

    // Frequency and SF
    snprintf(line, sizeof(line), "%.1fMHz SF%d", LORA_FREQUENCY, LORA_SPREADING_FACTOR);
    display.drawStr(0, 34, line);
    
    // Statistics
    snprintf(line, sizeof(line), "RX: %lu FW: %lu", stats.rx_ok, stats.rx_fw);
    display.drawStr(0, 46, line);
    
    // Time
    time_t now = time(nullptr);
    struct tm* timeinfo = localtime(&now);
    snprintf(line, sizeof(line), "%02d:%02d:%02d", 
             timeinfo->tm_hour, timeinfo->tm_min, timeinfo->tm_sec);
    display.drawStr(0, 58, line);
    
    display.sendBuffer();
    #endif
}

// ===========================
// WIFI FUNCTIONS
// ===========================
void initWiFi() {
    Serial.print("[WIFI] Connecting to ");
    Serial.print(WIFI_SSID);
    Serial.print("...");
    
    #if DISPLAY_ENABLED
    display.clearBuffer();
    display.drawStr(0, 10, "WiFi connecting...");
    display.sendBuffer();
    #endif
    
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    
    unsigned long startTime = millis();
    while (WiFi.status() != WL_CONNECTED) {
        if (millis() - startTime > WIFI_CONNECT_TIMEOUT) {
            Serial.println("\n[WIFI] Connection timeout!");
            #if DISPLAY_ENABLED
            display.clearBuffer();
            display.drawStr(0, 10, "WiFi FAILED!");
            display.sendBuffer();
            #endif
            delay(5000);
            ESP.restart();
        }
        delay(500);
        Serial.print(".");
    }
    
    Serial.println(" Connected!");
    Serial.print("[WIFI] IP address: ");
    Serial.println(WiFi.localIP());
    Serial.print("[WIFI] MAC address: ");
    Serial.println(WiFi.macAddress());
    
    // Resolve server hostname
    if (WiFi.hostByName(SERVER_HOST, serverIP)) {
        Serial.print("[SERVER] Resolved to: ");
        Serial.println(serverIP);
    } else {
        Serial.println("[SERVER] ERROR: Could not resolve hostname");
    }
}

// ===========================
// OTA FUNCTIONS
// ===========================
void initOTA() {
    Serial.println("[OTA] Initializing OTA...");
    
    // Imposta hostname per mDNS
    ArduinoOTA.setHostname(OTA_HOSTNAME);
    
    // Imposta password (opzionale ma consigliata)
    ArduinoOTA.setPassword(OTA_PASSWORD);
    
    // Callback quando inizia l'aggiornamento
    ArduinoOTA.onStart([]() {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH) {
            type = "sketch";
        } else {  // U_SPIFFS
            type = "filesystem";
        }
        
        Serial.println("[OTA] Start updating " + type);
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA Update...");
        display.drawStr(0, 25, type.c_str());
        display.sendBuffer();
        #endif
        
        // Ferma la radio durante l'aggiornamento
        if (radioInitialized) {
            radio.standby();
        }
    });
    
    // Callback durante l'aggiornamento (progresso)
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        unsigned int percent = (progress * 100) / total;
        Serial.printf("[OTA] Progress: %u%%\r", percent);
        
        #if DISPLAY_ENABLED
        if (percent % 10 == 0) {  // Aggiorna display ogni 10%
            display.clearBuffer();
            display.drawStr(0, 10, "OTA Update...");
            char progressStr[32];
            snprintf(progressStr, sizeof(progressStr), "Progress: %u%%", percent);
            display.drawStr(0, 25, progressStr);
            display.sendBuffer();
        }
        #endif
    });
    
    // Callback quando l'aggiornamento è completato
    ArduinoOTA.onEnd([]() {
        Serial.println("\n[OTA] Update complete!");
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA Complete!");
        display.drawStr(0, 25, "Rebooting...");
        display.sendBuffer();
        #endif
        
        delay(1000);
    });
    
    // Callback in caso di errore
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("[OTA] Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) {
            Serial.println("Auth Failed");
        } else if (error == OTA_BEGIN_ERROR) {
            Serial.println("Begin Failed");
        } else if (error == OTA_CONNECT_ERROR) {
            Serial.println("Connect Failed");
        } else if (error == OTA_RECEIVE_ERROR) {
            Serial.println("Receive Failed");
        } else if (error == OTA_END_ERROR) {
            Serial.println("End Failed");
        }
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA ERROR!");
        display.sendBuffer();
        #endif
        
        // Riavvia la radio
        if (radioInitialized) {
            radio.startReceive();
        }
    });
    
    ArduinoOTA.begin();
    
    Serial.println("[OTA] Ready!");
    Serial.println("[OTA] Hostname: esp32-gateway.local");
    Serial.print("[OTA] IP address: ");
    Serial.println(WiFi.localIP());
}

// ===========================
// NTP FUNCTIONS
// ===========================
void initNTP() {
    Serial.print("[NTP] Synchronizing time...");
    
