pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    Serial.println("\n[TX_DL] ===== TRASMISSIONE DOWNLINK =====");
    Serial.printf("[TX_DL] Lunghezza: %d bytes\n", length);
    Serial.print("[TX_DL] Frame (HEX): ");
    for (size_t i = 0; i < length; i++) {
        Serial.printf("%02X ", data[i]);
    }
    Serial.println();

    // MHDR (primo byte, bit 7-5) dice se questo downlink è una Join Accept:
    // in quel caso le finestre RX1/RX2 seguono il timing (più lungo) della
    // join-accept, non quello dei downlink dati - vedi JOIN_ACCEPT_DELAY1/2.
    uint8_t mtype = length > 0 ? (data[0] >> 5) & 0x07 : 0xFF;
    bool isJoinAccept = (mtype == 0x01);
    unsigned long rx1Delay = isJoinAccept ? JOIN_ACCEPT_DELAY1 : RX1_DELAY;
    unsigned long rx2Delay = isJoinAccept ? JOIN_ACCEPT_DELAY2 : RX2_DELAY;
    Serial.printf("[TX_DL] Tipo: %s (rx1=%lums, rx2=%lums)\n",
                  isJoinAccept ? "Join Accept" : "Data downlink", rx1Delay, rx2Delay);

    // Calcola tempo trascorso dalla ricezione
    unsigned long elapsed = getElapsedTime(rxTimestamp);
    Serial.printf("[TX_DL] Tempo trascorso dalla RX: %lu ms\n", elapsed);

    bool transmitted = false;
    int rxWindow = 0;

    // ===== TENTATIVO RX1 =====
    if (elapsed < rx1Delay) {
        unsigned long waitTime = rx1Delay - elapsed;
        Serial.printf("[TX_DL] Attendo %lu ms per finestra RX1...\n", waitTime);
        delay(waitTime);
        
        unsigned long txStart = millis();
        unsigned long actualDelay = txStart - rxTimestamp;
        Serial.printf("[TX_DL] >>> FINESTRA RX1 (delay reale: %lu ms) <<<\n", actualDelay);
        
        digitalWrite(LED_PIN, LOW);
        
        // LoRaWAN usa IQ invertito per downlink!
        radio.invertIQ(true);
        
        int state = radio.transmit(data, length);
        
        // Ripristina IQ normale
        radio.invertIQ(false);
        
        unsigned long txEnd = millis();
        unsigned long txDuration = txEnd - txStart;
        
        if (state == RADIOLIB_ERR_NONE) {
            Serial.printf("[TX_DL] ✅ Trasmesso in RX1! (TX: %lu ms)\n", txDuration);
            stats.tx_emitted++;
            justTransmitted = true;
            transmitted = true;
            rxWindow = 1;
        } else {
            Serial.printf("[TX_DL] ❌ Errore RX1: %d\n", state);
        }
        
        digitalWrite(LED_PIN, HIGH);
    } else {
        Serial.printf("[TX_DL] ⚠️ RX1 persa (elapsed: %lu ms)\n", elapsed);
    }
    
    // ===== TENTATIVO RX2 (solo per debug, normalmente skip se RX1 OK) =====
    if (!transmitted) {
        elapsed = getElapsedTime(rxTimestamp);

        if (elapsed < rx2Delay) {
            unsigned long waitTime = rx2Delay - elapsed;
            Serial.printf("[TX_DL] Attendo %lu ms per finestra RX2...\n", waitTime);
            delay(waitTime);
            
            unsigned long txStart = millis();
            unsigned long actualDelay = txStart - rxTimestamp;
            Serial.printf("[TX_DL] >>> FINESTRA RX2 (delay reale: %lu ms) <<<\n", actualDelay);
            
            digitalWrite(LED_PIN, LOW);
            
            radio.invertIQ(true);
            int state = radio.transmit(data, length);
            radio.invertIQ(false);
            
            unsigned long txEnd = millis();
            unsigned long txDuration = txEnd - txStart;
            
            if (state == RADIOLIB_ERR_NONE) {
                Serial.printf("[TX_DL] ✅ Trasmesso in RX2! (TX: %lu ms)\n", txDuration);
                stats.tx_emitted++;
                justTransmitted = true;
                transmitted = true;
                rxWindow = 2;
            } else {
                Serial.printf("[TX_DL] ❌ Errore RX2: %d\n", state);
            }
            
            digitalWrite(LED_PIN, HIGH);
        } else {
            Serial.printf("[TX_DL] ❌ RX2 persa (elapsed: %lu ms)\n", elapsed);
        }
    }
    
    // ===== RIEPILOGO =====
    if (transmitted) {
        Serial.printf("[TX_DL] ✅ Successo! Finestra: RX%d\n", rxWindow);
    } else {
        Serial.println("[TX_DL] ❌ FALLITO: Nessuna finestra disponibile");
    }
    
    Serial.println("[TX_DL] ==============================\n");
    
    // Riavvia la ricezione
    int state = radio.startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        Serial.println("[LORA] Radio tornata in ascolto");
    } else {
        Serial.printf("[LORA] ❌ Errore riavvio ricezione: %d\n", state);
        radioInitialized = false;
    }
    
    // Ritorna true se la trasmissione è riuscita
    return transmitted;
}

// ===========================
// DECODIFICA PACCHETTO LORAWAN
// ===========================
void decodeLoRaWANPacket(uint8_t* data, size_t length) {
    if (length < 12) {
        Serial.println("[DECODE] ⚠️ Pacchetto troppo corto per essere LoRaWAN valido (min 12 bytes)");
        return;
    }
    
    Serial.println("\n[DECODE] ===== DECODIFICA PACCHETTO LORAWAN =====");
    
    // MHDR (1 byte)
    uint8_t mhdr = data[0];
    uint8_t mtype = (mhdr >> 5) & 0x07;  // Bits 7-5
    uint8_t major = mhdr & 0x03;  // Bits 1-0
    
    const char* mtypeNames[] = {
        "Join Request", "Join Accept", "Unconfirmed Data Up", 
        "Unconfirmed Data Down", "Confirmed Data Up", "Confirmed Data Down",
        "RFU", "Proprietary"
    };
    
    Serial.printf("[DECODE] MHDR: 0x%02X\n", mhdr);
    Serial.printf("[DECODE] MType: %d (%s)\n", mtype, mtype < 8 ? mtypeNames[mtype] : "Unknown");
    Serial.printf("[DECODE] Major: %d (LoRaWAN R%d)\n", major, major + 1);
    
    // DevAddr (4 bytes, little-endian)
    uint32_t devAddr = ((uint32_t)data[1]) | 
                       ((uint32_t)data[2] << 8) | 
                       ((uint32_t)data[3] << 16) | 
                       ((uint32_t)data[4] << 24);
    
    Serial.printf("[DECODE] DevAddr: 0x%08X\n", devAddr);
    Serial.printf("[DECODE] DevAddr (little-endian bytes): %02X %02X %02X %02X\n", 
                  data[1], data[2], data[3], data[4]);
    
    // FCtrl (1 byte)
    uint8_t fctrl = data[5];
    bool adr = (fctrl & 0x80) != 0;
    bool adrAckReq = (fctrl & 0x40) != 0;
    bool ack = (fctrl & 0x20) != 0;
    bool classB = (fctrl & 0x10) != 0;
    uint8_t foptsLen = fctrl & 0x0F;
    
    Serial.printf("[DECODE] FCtrl: 0x%02X\n", fctrl);
    Serial.printf("[DECODE]   ADR: %s\n", adr ? "SI" : "NO");
    Serial.printf("[DECODE]   ADRACKReq: %s\n", adrAckReq ? "SI" : "NO");
    Serial.printf("[DECODE]   ACK: %s\n", ack ? "SI" : "NO");
    Serial.printf("[DECODE]   ClassB: %s\n", classB ? "SI" : "NO");
    Serial.printf("[DECODE]   FOptsLen: %d\n", foptsLen);
    
    // FCnt (2 bytes, little-endian)
    uint16_t fcnt = ((uint16_t)data[6]) | ((uint16_t)data[7] << 8);
    Serial.printf("[DECODE] FCnt: %d (0x%04X)\n", fcnt, fcnt);
    
    size_t pos = 8;
    
    // FOpts (se presente, lunghezza in FCtrl)
    if (foptsLen > 0) {
        if (pos + foptsLen <= length - 4) {  // -4 per MIC
            Serial.printf("[DECODE] FOpts (%d bytes): ", foptsLen);
            for (uint8_t i = 0; i < foptsLen; i++) {
                Serial.printf("%02X ", data[pos + i]);
            }
            Serial.println();
            pos += foptsLen;
        } else {
            Serial.println("[DECODE] ⚠️ FOptsLen maggiore dello spazio disponibile");
        }
    }
    
    // FPort (1 byte, presente solo se c'è payload)
    uint8_t fport = 0;
    bool hasFPort = false;
    if (pos < length - 4) {  // C'è spazio per FPort + payload + MIC
        fport = data[pos];
        hasFPort = true;
        pos++;
        
        Serial.printf("[DECODE] FPort: %d\n", fport);
        
        // FRMPayload (se presente)
        size_t payloadLen = length - pos - 4;  // -4 per MIC
        if (payloadLen > 0) {
            Serial.printf("[DECODE] FRMPayload (%d bytes): ", payloadLen);
            for (size_t i = 0; i < payloadLen && i < 32; i++) {  // Limita a 32 bytes per display
                Serial.printf("%02X ", data[pos + i]);
            }
            if (payloadLen > 32) {
                Serial.print("...");
            }
            Serial.println();
            
            // Prova a decodificare come ASCII se sembra testo
            Serial.print("[DECODE] FRMPayload (ASCII): ");
            for (size_t i = 0; i < payloadLen && i < 32; i++) {
                uint8_t b = data[pos + i];
                if (b >= 32 && b <= 126) {
                    Serial.printf("%c", b);
                } else {
                    Serial.print(".");
                }
            }
            if (payloadLen > 32) {
                Serial.print("...");
            }
            Serial.println();
        }
    }
    
