pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    // MIC (4 bytes, ultimi 4 bytes)
    Serial.printf("[DECODE] MIC: %02X %02X %02X %02X\n", 
                  data[length-4], data[length-3], data[length-2], data[length-1]);
    
    Serial.println("[DECODE] ===========================================\n");
}

// ===========================
// TX_ACK - Conferma trasmissione downlink a ChirpStack
// ===========================
void sendTxAck(uint16_t token) {
    if (!WiFi.isConnected()) {
        Serial.println("[TX_ACK] WiFi non connesso, skip TX_ACK");
        return;
    }
    
    Serial.printf("[TX_ACK] Invio TX_ACK con token 0x%04X\n", token);
    
    udpClient.beginPacket(serverIP, SERVER_PORT);
    
    // Protocol version (always 0x02)
    udpClient.write((uint8_t)0x02);
    
    // Token (stesso del PULL_RESP)
    udpClient.write((uint8_t)(token >> 8));
    udpClient.write((uint8_t)(token & 0xFF));
    
    // Identifier: TX_ACK = 0x05
    udpClient.write((uint8_t)0x05);
    
    // Gateway ID (8 bytes)
    for (int i = 7; i >= 0; i--) {
        udpClient.write((uint8_t)((gatewayId >> (i * 8)) & 0xFF));
    }
    
    int result = udpClient.endPacket();
    
    if (result) {
        Serial.println("[TX_ACK] ✅ TX_ACK inviato con successo");
    } else {
        Serial.println("[TX_ACK] ❌ Errore invio TX_ACK");
    }
}

// ===========================
// DOWNLINK RESPONSE
// ===========================
void sendDownlinkResponse(unsigned long rxTimestamp, PullRespPacket *pullRespPacket) {
    if (!radioInitialized) {
        Serial.println("[DOWNLINK] Radio non inizializzata");
        radio.startReceive();
        return;
    }
    
    if (pullRespPacket) {
        // Serial.printf("[DOWNLINK] ✅ %d messaggio/i in coda per DevAddr 0x%08X!\n", messagesForDevAddr, devAddr);
        
        // Trasmetti il primo messaggio in RX1
        // PendingDownlink* dl1 = &downlinkQueue[indices[0]];
        Serial.println("[DOWNLINK] 📤 Trasmissione messaggio 1 in RX1...");
        bool tx1Success = transmitDownlink(
            pullRespPacket->responseData.decodedPayload,  // Dati binari decodificati (non base64!)
            pullRespPacket->responseData.decodedLength,    // Lunghezza corretta
            rxTimestamp
        );
        
        if (tx1Success) {
            Serial.println("[DOWNLINK] ✅ Messaggio 1 trasmesso con successo, invio TX_ACK");
            sendTxAck(pullRespPacket->token);

            dowQueue.remove(pullRespPacket);
            
        } else {
            Serial.println("[DOWNLINK] ❌ Trasmissione messaggio 1 fallita, NON invio TX_ACK");
        }
        
        // Reset compatibilità
        // pendingDownlink.pending = false;
        return;
    }
    
}


